app/app/controllers/hours_controller.rb

  def show
    @hour = Hour.find(params[:id])
---
SELECT "hours".* FROM "hours" WHERE ("hours"."id" = 1) LIMIT 1

  def create
    @hour = Hour.new(params[:hour])
    if @hour.save
---
INSERT INTO "hours" ("date", "start", "location", "number_slots", "created_at", "updated_at") VALUES (NULL, NULL, '', NULL, '2011-02-01 18:02:57.569044', '2011-02-01 18:02:57.569044')