app/app/controllers/slots_controller.rb

SELECT "hours".* FROM "hours" WHERE ("hours"."id" = 1) LIMIT 1
INSERT INTO "slots" ("start", "end", "email", "bookstatus", "hour_id", "created_at", "updated_at") VALUES ('2011-02-02 13:00:00.000000', '2011-02-02 14:00:00.000000', 'harjeet@gm.com', 'f', 1, '2011-02-02 22:33:48.159629', '2011-02-02 22:33:48.159629')
---
  def create
    @hour = Hour.find(params[:hour_id])
    @slot = @hour.slots.build(params[:slot])
    if @slot.save

SELECT "slots".* FROM "slots" WHERE ("slots"."id" = 1) LIMIT 1
---
  def edit
    @slot = Slot.find(params[:id])

SELECT "slots".* FROM "slots" WHERE ("slots"."id" = 3) LIMIT 1
UPDATE "slots" SET "email" = 'jack@daniels.com', "updated_at" = '2011-02-05 01:47:11.858275' WHERE ("slots"."id" = 3)
---
  def update
    @slot = Slot.find(params[:id])
    if @slot.update_attributes(params[:slot])