app/app/views/hours/show.html.erb

SELECT COUNT(*) FROM "slots" WHERE ("slots".hour_id = 2)
---
<h2>slots</h2>
<% if @hour.slots.empty? %>